УТ_11_4.Umico/src/Documents/ВозвратТоваровОтКлиента/ВозвратТоваровОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="69907d01-2fac-4a13-a6a2-2cf0af2a60bf">
  <name>ВозвратТоваровОтКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>UMC_ОплаченноБалламиUmico</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UMC_НомерКартыUmico</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="cd159d11-fbbc-45c3-9732-fae4603622ee">
    <name>ЗаявкаНаВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="482efeb2-6584-4e29-acb0-718c0859e513">
    <name>ДокументРеализации</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="68d3dd28-545a-42e5-aa05-b76a245a9012">
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="479ba110-d494-41e5-82d9-be4b089a90d7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="483844b1-4482-44da-9daa-f17bdaaa027b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6244b44a-d877-44cd-bc7b-fc6119a2bd39">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a876f4a3-9894-49f6-9bf8-2a78539f44bc">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="540b6290-f046-4049-ac65-5814b24bea80">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="801f7d80-e33b-43f3-ac0b-88b3d7ee5050">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a0d8047b-7a94-49e2-86ee-0b8e4788f267">
    <name>СпособКомпенсации</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СпособыКомпенсацииВозвратовТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="1ab231dd-6cb1-4eba-b904-77e3ee931bed">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="25ecdf9b-133b-4180-b9c4-ea2233e14413">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="c4a26d7d-21b2-45a9-ba3e-50e64967479d">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="41cdf308-8947-419f-abb9-d77a2040b6ad">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="2bc43cbb-dada-43dc-a47b-44cf67b74060">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="eac1d361-a3c6-4456-9834-0fce91edbe24">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="96980c9d-99f1-4c26-8390-ece1780314d0">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dacb0bc0-61de-4bdf-8491-9f4ea53a0b59">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3be3a509-1cb4-47ee-857e-e0ce713fe870">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0c7d1756-e131-4741-9a18-f57893355a23">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e73ceecb-f4b7-413b-80a1-d256a8c90dcc">
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ПорядокОплатыПоСоглашениям</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="19827912-67b6-4817-ab4b-62c3f704fff4">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="63cb42ba-45e9-4e94-b6c3-7f12888a229e">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="4811da53-e859-4162-a63e-164da5224c2c">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e9a0cf90-2705-4ad4-ab33-ce1f6c2f7f96">
    <name>ВозвратПереданнойМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dd688466-f7a0-4ec0-a7e4-1bb6167202a1">
    <name>ПредусмотренЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a6c6aa3c-d204-42ce-932f-4614bc25ef72">
    <name>ВыданыДенежныеСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3afca1db-3420-4bce-bdbc-a32b262c0214">
    <name>НомерРасходногоКассовогоОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dde489bd-992d-4491-a155-b3e74311494e">
    <name>ДатаРасходногоКассовогоОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="a04e6279-7047-4b8c-b21b-ad2da7969202">
    <name>ПокупательНеПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UMC_ОснованиеВозвратаUmico</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="d97593cc-9e00-40de-8188-964163b9a47f">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="170fa9dd-8626-4d47-a7a8-120763cd74f7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="ae7da8e1-be5b-4984-bcdd-fe6ce391798c">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="0d5ab1a1-c2ec-4fef-b6aa-cf48e114f62d">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="77e19946-3aa6-42c6-bdbd-8071c8347d2f">
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="c2f05c95-112c-49a8-9622-4a54d2309616">
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="3ab147ba-33c8-4fee-95d8-8793c6815d47">
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="8ec9788f-c232-4ca8-b273-1948648ca8c8">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="6f077424-7739-4132-8543-5b4e84f4f846">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="e168c4d6-c2e0-4edb-aae2-742d1114fcb1">
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="cf828e93-f8c0-4444-9c08-2dd7032bf494">
      <name>Порча</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="ac517b2f-8bbe-44ef-b513-0e5f19499cfa">
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="1fb5892b-e8f0-4be4-ad14-feed7c553f12">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="633bfa15-0869-4d94-bc0a-e9411f7119dd">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d025c151-feb1-46f1-96df-79fbe4b8d20e">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="f6b893e0-9dee-4373-8c55-1d2ed7baf790">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="3579f135-e7ba-4fbd-8153-29e0e21b5115">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="72d0be57-210d-4f57-bb99-9a68a3e4fc94">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="dda0c316-494c-49fa-8dc3-0f2b7fb432c7">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="6b5270cc-f942-4f9c-8b00-311c7859645b">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="83a397d6-087d-43ea-8a1b-535791c0ad6f">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="47a744cb-233b-44b2-908e-7ead60620ba2">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="c1a2594d-47b7-4648-b8df-bf2ad27ebc9c">
      <name>ДокументРеализации</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="d2cf9a8e-843b-437e-9287-aef240d48713">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_11_4.Umico/src/Documents/ВозвратТоваровОтКлиента/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
Процедура UMC_ЗаполнитьРеквизитыUmicoНаОсновании() Экспорт
	
	UMC_РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(UMC_ОснованиеВозвратаUmico, "UMC_НомерКартыUmico");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, UMC_РеквизитыОснования);
	
КонецПроцедуры

#КонецОбласти	
	
#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура UMC_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		UMC_Основание = ДокументРеализации; // ДокументСсылка.РеализацияТоваровУслуг
		UMC_ОснованиеВозвратаUmico = UMC_Основание;
		
		UMC_ЗаполнитьРеквизитыUmicoНаОсновании();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
